{
  "Id": null,
  "Name": "StudiekatalogStudieprogram",
  "Description": "Index all studieprogram items in studiekatalog using embeddings. This enables search in studiekatalog",
  "RequestorDepartments": [
    {
      "Name": "IT-avdelingen",
      "Stedkode": "262600"
    }
  ],
  "Participants": [
    {
      "Displayname": "Espen Rivedal",
      "UitUsername": "eje003@uit.no",
      "Role": "Developer"
    }
  ],
  "Configuration": {
    "MinNumberOfQuestionsPerItem": 5,
    "MaxNumberOfQuestionsPerItem": 20,
    "ModelForQuestionGeneration": "GPT-4o-Mini",
    "ModelForEmbeddings": "text-embedding-ada-002",
    "DbName": "RagStudiekatalogStudieprogram",
    "ItemCollectionName": "StudieprogramItems",
    "EmbeddingCollectioName": "StudieprogramItemEmbeddings",
    "EmbeddingTypes": [
      0
    ],
    "EmbeddingEventCollectioName": "StudieprogramEmbeddingEvents"
  },
  "ContentItems": [
    {
      "Id": null,
      "SystemName": "Fs",
      "DataType": "Studieprogram",
      "ContentType": "INLINE",
      "Title": "Automasjon, ingeniør - bachelor (ordinær, y-vei)",
      "Description": "\u003Cp\u003EVil du lære hvordan du lager smarte tekniske systemer som du kan styre med små datamaskiner? Har du lyst til å jobbe med elektronikk, data og teknologi? Automasjon handler om å programmere maskiner og lage tekniske systemer som utfører store og små arbeidsoppgaver helt på egen hånd, og i ingeniørstudiet automasjon lærer du å designe automatiske systemer som jobber mye raskere, tryggere og mer nøyaktig enn det vi mennesker klarer. I dag finner du automasjonsteknologi rundt deg overalt, og som utdannet automasjonsingeniør kan du være med og lage supereffektive industribedrifter, smarte bygg som sparer energi, pålitelig infrastruktur som klarer seg helt selv og sikkerhetssystemer som forhindrer ulykker. Automasjon ved UiT er det smarte ingeniørstudiet for deg som vil forenkle og forbedre samfunnet!\u003C/p\u003E\u003Cp\u003EHar du fagbrev i elektro, data eller automatisering? Da kan studiealternativet Y-vei være aktuelt.\u003C/p\u003E",
      "ContentText": "## Kort introduksjon\n\n\u003Cp\u003EVil du lære hvordan du lager smarte tekniske systemer som du kan styre med små datamaskiner? Har du lyst til å jobbe med elektronikk, data og teknologi? Automasjon handler om å programmere maskiner og lage tekniske systemer som utfører store og små arbeidsoppgaver helt på egen hånd, og i ingeniørstudiet automasjon lærer du å designe automatiske systemer som jobber mye raskere, tryggere og mer nøyaktig enn det vi mennesker klarer. I dag finner du automasjonsteknologi rundt deg overalt, og som utdannet automasjonsingeniør kan du være med og lage supereffektive industribedrifter, smarte bygg som sparer energi, pålitelig infrastruktur som klarer seg helt selv og sikkerhetssystemer som forhindrer ulykker. Automasjon ved UiT er det smarte ingeniørstudiet for deg som vil forenkle og forbedre samfunnet!\u003C/p\u003E\u003Cp\u003EHar du fagbrev i elektro, data eller automatisering? Da kan studiealternativet Y-vei være aktuelt.\u003C/p\u003E\n\n## Studieprogrammets mål\n\n\u003Cp\u003E\u003Cb\u003EKunnskap \u003C/b\u003E\u003C/p\u003E\u003Cp\u003EK1 Kandidaten har bred kunnskap som gir et helhetlig systemperspektiv på ingeniørfaget generelt, med fordypning innen automasjon som systemforståelse, systemutvikling, og prinsipper for automatiserte systemer. Fordypningen omfatter mikrokontrollere og embedded systems, reguleringsteknikk, styring og applikasjonsutvikling. Dette inkluderer kunnskap om\u003C/p\u003E\u003Cp\u003E- Programmering (C, Matlab, Pyton og C#)\u003C/p\u003E\u003Cp\u003E- Databaser og webapplikasjoner\u003C/p\u003E\u003Cp\u003E- Industriell datakommunikasjon\u003C/p\u003E\u003Cp\u003E- Elektronikk\u003C/p\u003E\u003Cp\u003E- PLS og datainnsamling\u003C/p\u003E\u003Cp\u003EVidere har kandidaten kunnskaper om problemløsning, modellering av systemer, programvareutvikling og prinsipper for oppbygning av SD-anlegg\u003C/p\u003E\u003Cp\u003EK2 Kandidaten har grunnleggende kunnskaper innen matematikk, fysikk og kjemi, samt samfunns- og økonomifag og om hvordan disse kan integreres i automatiseringsteknisk problemløsning \u003C/p\u003E\u003Cp\u003EK3 Kandidaten kunnskap om teknologiutvikling, ingeniørens rolle i samfunnet og formålet og konsekvenser av bruk av automatisering i et samfunnsperspektiv\u003C/p\u003E\u003Cp\u003EK4 Kandidaten kjenner til forsknings- og utviklingsarbeid innenfor fagfeltet, samt relevante metoder og arbeidsmåter\u003C/p\u003E\u003Cp\u003EK5 Kan utvikle seg videre og oppdatere sin kunnskap innenfor automasjonsfaget, både gjennom informasjonsinnhenting og kontakt med fagmiljøer og praksis. \u003C/p\u003E\u003Cp\u003E\u003Cb\u003E \u003C/b\u003E\u003C/p\u003E\u003Cp\u003E\u003Cb\u003EFerdigheter\u003C/b\u003E \u003C/p\u003E\u003Cp\u003EF1 Kandidaten kan anvende kunnskap og resultater fra tidligere forsknings- og utviklingsprosjekter til å løse tekniske teoretiske og praktiske problem knyttet til automatisering. Dette være seg automatisering av prosessanlegg eller konstruere mindre, innebygde system.\u003C/p\u003E\u003Cp\u003EF2 Kandidaten har ingeniørfaglige datatekniske ferdigheter, kan arbeide på laboratorier og behersker målemetoder, feilsøkingsmetodikk, bruk av relevante instrumenter og programvare. Dette inkluderer:\u003C/p\u003E\u003Cp\u003E- Bruke sensorer loggeutstyr til innsamling av måledata\u003C/p\u003E\u003Cp\u003E- Forstå ulike protokoller og fysiske standarder innen datakommunikasjon til å kople sammen utstyr og etterspørre måle- og logge-data\u003C/p\u003E\u003Cp\u003E- Anvende programmeringsverktøy og programvare for datainnsamling, prosessovervåking og styring\u003C/p\u003E\u003Cp\u003E- Anvende programvare for og systemmodellering og simulering\u003C/p\u003E\u003Cp\u003EF3 Kandidaten kan anvende kunnskap til å identifisere og analysere problem og se muligheter for hvordan automatisering kan anvendes for å forenkle arbeidsoppgaver, øke produktivitet og forbedre sikkerhet\u003C/p\u003E\u003Cp\u003EF4 Kandidaten kan finne, vurdere, bruke og henvise til informasjon og fagstoff og framstille dette både skriftlig og muntlig, slik at det belyser en problemstilling\u003C/p\u003E\u003Cp\u003EF5 Kan bidra til nytenkning, innovasjon og entreprenørskap gjennom deltakelse i utvikling, kvalitetssikring og realisering av bærekraftige og samfunnsnyttige produkter, systemer og løsninger som omhandler automasjon\u003C/p\u003E\u003Cp\u003E\u003Cb\u003E \u003C/b\u003E\u003C/p\u003E\u003Cp\u003E\u003Cb\u003EGenerell kompetanse \u003C/b\u003E\u003C/p\u003E\u003Cp\u003EG1 Kandidaten har innsikt i miljømessige, helsemessige, samfunnsmessige og økonomiske konsekvenser av produkter og løsninger relatert til automatisering og kan sette disse i et etisk og et livsløpsperspektiv.\u003C/p\u003E\u003Cp\u003EG2 Kandidaten kan formidle automasjonsfaglig kunnskap til ulike målgrupper både skriftlig og muntlig på norsk og engelsk og kan bidra til å synliggjøre betydning og konsekvenser av automatiseringen\u003C/p\u003E\u003Cp\u003EG3 Kandidaten kan reflektere over egen faglig utøvelse, også i team og i en tverrfaglig sammenheng, og kan tilpasse egen faglig utøvelse til den aktuelle arbeidssituasjon.\u003C/p\u003E\u003Cp\u003EG4 Kan bidra til utvikling av god praksis gjennom å delta i faglige diskusjoner innenfor fagområdet og dele sine kunnskaper og erfaringer med andre.\u003C/p\u003E\n\n## Studieprogrammets innhold\n\n\u003Cp\u003EAutomasjon handler om å utvikle systemer for datainnsamling, overvåking og styring av fysiske prosesser og systemer. Sentrale fagfelt er måleteknikk, mikrokontrollere og elektronikk, datakommunikasjon og dataprogrammering, samt styrings- og reguleringsteknikk. \u003C/p\u003E\u003Cp\u003E \u003C/p\u003E\u003Cp\u003EDu får innsikt i: \u003C/p\u003E\u003Cp\u003E \u003C/p\u003E\u003Cul\u003E\u003Cli\u003EIndustriell automasjon som overvåking og styring av produksjon, roboter etc. \u003C/li\u003E\u003Cli\u003EProgrammering i en rekke språk og utviklingsverktøy (Matlab, Python, C, C#, Codesys) \u003C/li\u003E\u003Cli\u003EDatasystemer og utvikling av applikasjoner og integrerte (embedded) systemer. \u003C/li\u003E\u003Cli\u003EMatematisk modellering av fysiske system. \u003C/li\u003E\u003Cli\u003EAutomatisk styring av fysiske system (reguleringsteknikk). \u003C/li\u003E\u003Cli\u003EProsessteknikk og prosessautomasjon. \u003C/li\u003E\u003Cli\u003EDatakommunikasjon og datalagring. \u003C/li\u003E\u003C/ul\u003E\n\n#Studieprogrammets opptakskrav\n\nGenerell studiekompetanse eller realkompetanse, og Matematikk (R1\u002BR2) og Fysikk 1 (\u003Ca href=\u0022 https://www.samordnaopptak.no/info/opptak/spesielle-opptakskrav/liste-over-kravkoder/\u0022\u003EHING\u003C/a\u003E)\n\n#Studieprogrammets opptaksinfo\n\n\u003Cp\u003E\u003Cb\u003EOpptakskrav ordinært løp\u003C/b\u003E:\u003C/p\u003E\u003Cp\u003EGenerell studiekompetanse eller realkompetanse, og Matematikk (R1\u002BR2) og Fysikk 1 (\u003Ca href=\u0022 https://www.samordnaopptak.no/info/opptak/spesielle-opptakskrav/liste-over-kravkoder/\u0022\u003EHING\u003C/a\u003E)\u003C/p\u003E\u003Cp\u003ESøkere som kan dokumentere ett av følgende kvalifiserer også for opptak:\u003Cbr /\u003E- generell studiekompetanse og bestått realfagkurs, eller\u003Cbr /\u003E- bestått 1-årig forkurs for ingeniørutdanning, eller\u003Cbr /\u003E- 2-årig teknisk fagskole etter rammeplan fastsatt av departementet 1998/99 og tidligere studieordninger\u003C/p\u003E\u003Cp\u003E\u003Cb\u003EFlere opptaksveier: \u003C/b\u003EMangler du studiekompetanse, nødvendige realfag eller har fagbrev kan du likevel kvalifisere for opptak til ingeniørstudier. \u003Ca href=\u0022 https://uit.no/utdanning/opptaksinfo#kapittel_711478\u0022\u003ESjekk hva som gjelder for deg\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EOpptakskrav Y-vei:\u003Cbr /\u003EGodkjent fag- eller svennebrev fra relevante yrkesfaglige utdanningsprogrammer, dvs, dvs. bestått Vg1 og Vg2 og minimum 2 års læretid i bedrift. Fag- eller svennebrev som bygger på \u003Ca href=\u0022https://uitno.box.com/s/vyx3kqrwi0zdiie47yc86sv0efr8mpf3\u0022\u003E\u0027Særløp\u0027, \u0027vekslingsmodellen\u0027 eller \u0027praksiskandidat\u0027\u003C/a\u003E kan også godkjennes.\u003C/p\u003E\u003Cp\u003ESøkere som har fag-/svenneprøve tatt i skole, må i tillegg dokumenter minimum 12 måneders praksis etter avlagt fagprøve.\u003C/p\u003E\u003Cp\u003EOpptak til Y-vei Automasjon krever yrkesfaglig utdanning og relevante \u003Ca href=\u0022https://uitno.box.com/s/7zuvojdoul5raw701msqsncsbi1plw4t\u0022\u003EFAGBREV\u003C/a\u003E\u003C/p\u003E\u003Cp\u003EFagprøven må være tatt etter Reform 94 eller Kunnskapsløftet. Søkere med fagbrev før Reform 94 eller utenlandsk fagbrev må dokumentere tilstrekkelig kompetanse for at det skal bli foretatt en individuell vurdering av realkompetanse.\u003C/p\u003E\u003Cp\u003ESøkere rangeres først etter karakterpoeng fra VG1 og VG2. Videre gis det følgende tilleggspoeng:\u003C/p\u003E\u003Cp\u003E- 3 tilleggspoeng for «meget godt» på fag/svennebrev»\u003Cbr /\u003E- 2 tilleggspoeng for kvinnelige søkere\u003C/p\u003E\u003Cp\u003EFagprøven må være bestått og endelig vitnemål må være lastet opp før studieplass kan tilbys. Det kan gis betinget tilbud, gitt at fagprøven bestås innen fristen for semesterregistrering.\u003C/p\u003E\u003Cp\u003EStudietilbudene krever ikke bakgrunn fra fagskole, gjennomført forkurs, tilpasning via sommerkurs e.l., som ellers gjelder for opptak ved manglende studiekompetanse. \u003C/p\u003E\u003Cp\u003EStudiet er adgangsregulert.\u003C/p\u003E\u003Cp\u003E\u003Cb\u003EKrav til realkompetanse:\u003C/b\u003E\u003C/p\u003E\u003Cp\u003ESøkeren må ha relevant yrkeserfaring i minimum 5 år omregnet til heltid. Inntil 2 av disse årene kan erstattes av:\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EMilitær-/siviltjeneste (førstegangstjeneste), inntil ett år \u003C/li\u003E\u003Cli\u003ERelevant utdanning fra videregående skole, folkehøgskole eller tilsvarende \u003C/li\u003E\u003Cli\u003ERelevant ulønnet arbeid (tillitsverv, organisasjonsarbeid, politiker) \u003C/li\u003E\u003Cli\u003EOmsorgsarbeid for egne barn kan telle inntil ett år.\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003EFor ingeniør i automatiseringsteknikk regnes følgende som relevant yrkeserfaring og utdanning:\u003C/p\u003E\u003Cp\u003EArbeid innen installasjon, drift og vedlikehold av styrings- og overvåkingsanlegg (automasjonsanlegg), elektriske anlegg (sterk og svakstrøm) og datanett/telekommunikasjon. Fagarbeidere (med fullført teknisk skole) innen disse arbeidsfeltene rangeres høyere enn lærlinger/hjelpearbeidere. Utdanning/kurs innen elektronikk, elektroteknikk og automasjon. Se også \u003Cb\u003E\u003Ca href=\u0022https://uitno.box.com/s/7zuvojdoul5raw701msqsncsbi1plw4t\u0022\u003EGodkjente FAGBREV\u003C/a\u003E\u003C/b\u003E\u003C/p\u003E\u003Cp\u003EVidere gjelder følgende faglige krav:\u003C/p\u003E\u003Cul\u003E\u003Cli\u003ENorsk fra Vg2 (videregående kurs I fra Reform -94) \u003C/li\u003E\u003Cli\u003EEngelsk fra Vg1 (grunnkurs fra Reform -94) \u003C/li\u003E\u003Cli\u003EMatematikk R1\u002BR2 (3MX fra Reform -94) \u003C/li\u003E\u003Cli\u003EFysikk 1 (2FY fra Reform -94)\u003C/li\u003E\u003C/ul\u003E\u003Cp\u003EStudiet tilbys som:\u003C/p\u003E\u003Cul\u003E\u003Cli\u003EOrdinært 3-årig løp i \u003Cb\u003ETromsø\u003C/b\u003E - søknadskode: \u003Cb\u003E186 017 \u003C/b\u003E(Samordna opptak) (Søknadsfrist 15. April)\u003C/li\u003E\u003Cli\u003EY-vei, 3-årig løp i \u003Cb\u003ETromsø\u003C/b\u003E - søknadskode: \u003Cb\u003E4019 \u003C/b\u003E(UiT sin søknadsweb) (Søknadsfrist 15. April)\u003C/li\u003E\u003C/ul\u003E\n\n#Studieprogrammets yrkesmuligheter\n\n\u003Cp\u003EDu finner eksempler på hvilke jobber våre studenter har fått, og info om hvilke arbeidsoppgaver det innebærer under «Mer info om studiet» -\u0026gt; «Hva jobber ferdig utdannede automasjonsingeniører med?»\u003C/p\u003E\u003Cp\u003E \u003C/p\u003E\u003Cp\u003ESom automasjonsingeniør kan du få mange spennende jobber innen alle typer industri som produksjonsbedrifter, prosessanlegg og offshore. Du kan jobbe med utvikling, design og konstruksjon av for eksempel bygg-automasjon, droner og ROV (remotely operated vehicle), autonome farkoster med mer. \u003C/p\u003E\u003Cp\u003E \u003C/p\u003E\u003Cp\u003EEtter studiet er du kvalifisert for mange typer jobber innen flere næringer. Grovt sett kan type jobb deles inn i følgende kategorier. \u003C/p\u003E\u003Cul\u003E\u003Cli\u003EOvervåkning, drift/vedlikehold, programmering og styring av eksisterende prosessanlegg (Mack, Finnfjord smelteverk, Drytech, Nordic Pharma, Lerøy, Melkøya, Oljeplattformer) \u003C/li\u003E\u003Cli\u003EOvervåkning, drift/vedlikehold, programmering og styring av eksisterende tekniske installasjoner (teknisk og medisinsk teknisk avdeling ved UNN, KSAT, Tromsø Kommune) \u003C/li\u003E\u003Cli\u003EUtvikling eller tilrettelegging av nye styringssystemer som leveres til eksterne kunder (JM-Hansen, Bravida, GK Tromsø, Spider, Siemens, Autronica, ABB, Aker Solutions) \u003C/li\u003E\u003Cli\u003EKonsulentbransjen (Multiconsult, Norconsult, Sweco) \u003C/li\u003E\u003Cli\u003EUtvikling av løsninger innen mikrokontrollere og elektronikk (Microchip, Nordic Semiconductor, Texas Instruments, National Instruments) \u003C/li\u003E\u003C/ul\u003E\u003Cp\u003E \u003C/p\u003E\u003Cp\u003ESom automasjonsingeniør har du store valgmuligheter på jobbmarkedet, de aller fleste bedrifter som bruker teknologiske løsninger har bruk for automasjonsingeniører. \u003C/p\u003E\n\n#Utveksling\n\nUniversitetet ønsker å legge til rette for at studenter som ønsker det skal kunne ta utvekslingsopphold i utlandet. De som ønsker dette bes så tidlig som mulig kontakte internasjonal koordinator.\n\n#Studieprogrammets varighet\n\n3 År\n\n#Studieprogrammets undervisningsmetode\n\nUndervisningen baserer seg på forelesninger, selvstendige øvingsoppgaver, gruppeoppgaver, laboratoriearbeid, simuleringsprogram og større prosjekter. Vurdering av studentenes prestasjoner skal foretas på en slik måte at en på et mest mulig sikkert grunnlag tester om studentene har tilegnet seg kunnskapen og kompetansen som er skissert i målsettingene for ingeniørutdanning. Faglige prestasjoner vurderes enten med bokstavkarakterer eller som bestått / ikke-bestått. For en rekke emner må et visst antall obligatoriske øvinger være godkjent før en får gå opp til avsluttende eksamen. Informasjon om eksamensform for de enkelte fagene er gitt i fagplanen.\n\n#Studieprogrammets søknadsfrist\n\n15. april\n\n#Studieprogrammets søke kode\n\n\u003Cbr /\u003EOrdinært løp: 186 017 (Samordna opptak)\u003Cbr /\u003EY-vei: 4019 (UiTs søknadsweb)",
      "ContentUrl": "https://uit.no/AUTOMAT",
      "ViewUrl": "https://uit.no/AUTOMAT",
      "Language": "Bokmål",
      "SourceSystemId": "FS:AUTOMAT_186_B",
      "SourceSystemAltId": "",
      "Created": "0001-01-01T00:00:00+00:00",
      "Updated": "0001-01-01T00:00:00+00:00",
      "RagProjectId": ""
    }
  ],
  "Created": "0001-01-01T00:00:00+00:00",
  "Updated": "0001-01-01T00:00:00+00:00"
}